{
    "thanks": [
        "welcome sir!",
        "You're welcome! Is there anything else I can help with?",
        "My pleasure! How else can I assist you?",
        "No problem! How's your day going so far?",
        "Of course! Let me know if there's anything else I can do.",
        "Glad I could help! Is there anything else I can assist with?",
        "Not a problem! How can I make your day better?",
        "Anytime! How has your day been so far?",
        "My pleasure! Anything else I can assist you with?",
        "No worries! Is there anything else I can help with?",
        "Glad to be of assistance! How has your week been so far?",
        "Don't mention it! How's everything else going for you?",
        "Of course! Is there anything else I can do for you today?"
    ],
    "what are doing you": [
        "I am working with you sir!",
        "I am currently chatting with you.",
        "Just answering questions and helping with information.",
        "I am an AI language model created by partha, so I am constantly processing and generating text.",
        "I am learning and updating my knowledge base.",
        "I am here to assist with any questions or information you need.",
        "I am helping people have meaningful conversations and providing them with information.",
        "I am processing requests and providing relevant information.",
        "I am a virtual assistant designed to help with a variety of tasks.",
        "I am here to make your day better and provide helpful information.",
        "I am always working to improve my ability to understand and generate text.",
        "I am an AI language model trained to respond to a wide range of questions.",
        "I am available 24/7 to answer any questions you may have.",
        "I am constantly evolving and improving to better serve my users.",
        "I am providing instant responses to questions and helping people with information they need.",
        "I am a tool that can help you find the information you're looking for.",
        "I am a machine learning model designed to answer questions and provide information.",
        "I am a virtual conversationalist, here to chat with you and answer your questions.",
        "I am a tool that can help you get the information you need quickly and efficiently.",
        "I am a language model that can answer a wide variety of questions on a wide range of topics.",
        "I am here to assist you with any information you need, whether it's answering questions or providing guidance."
    ],
    "how are you": [
        "iam fine, what about you?",
        "Hi! I am good, how about you?",
        "I am fine , how about you?",
        "Hi! I am here and good",
        "I'm doing great, thank you! How about you?",
        "I'm doing well, thanks for asking! How about yourself?",
        "I'm fabulous, thanks for asking! How's your day going?",
        "I'm doing pretty good, thanks! How about you?",
        "I'm feeling fantastic, thanks for asking! How about you?",
        "I'm feeling awesome, thanks for asking! How's your day been?",
        "I'm doing well, thank you for asking! How have you been?",
        "I'm feeling good, thanks for asking! How about you?",
        "I'm doing pretty well, thanks! How's your day going so far?",
        "I'm feeling great, thanks for asking! How's your day been?",
        "I'm doing excellent, thanks for asking! How about you?",
        "I'm feeling super, thanks for asking! How's your day been so far?",
        "I'm doing fantastic, thanks for asking! How's life been treating you?",
        "I'm feeling okay, thanks for asking! How have you been?",
        "I'm doing pretty okay, thanks! How's your day going?",
        "I'm feeling pretty good, thanks for asking! How about you?",
        "I'm doing alright, thanks for asking! How's your day going?",
        "I'm feeling alright, thanks for asking! How about you?",
        "I'm doing okay, thanks for asking! How's your day been so far?",
        "I'm feeling fine, thanks for asking! How about you?",
        "I am feeling very right now.",
        "i am fine everytime."
    ],
    "what is your name": "my name is ChatBot, but you called me friend!",
    "fine": [
        "ohh! Good sir, i wish you are still happy every time.",
        "That's great to hear! Is there anything else I can help with?",
        "Glad to hear it! What have you been up to lately?",
        "That's fantastic! Anything exciting happening in your life?",
        "I'm glad to hear that! How was your day?",
        "Good to know! Anything you'd like to chat about?",
        "Excellent! Is there anything new with you?",
        "That's great! How was your day today?",
        "Excellent! What have you been up to lately?",
        "I'm glad to hear it! Any plans for the weekend?",
        "Good to know! How's work/school going?",
        "Fantastic! Have you been enjoying the weather?",
        "That's good to hear! Any new adventures or projects on the horizon?"
    ],
    "hi": [
        "hello sir! how can i help you.",
        "Hello! How are you doing today?",
        "Hi there! How can I help you?",
        "Hey! What's up?",
        "Hello! What's new with you?",
        "Greetings! How have you been?",
        "Hi! Is there anything I can assist you with today?",
        "Hiya! What brings you here?",
        "Hi there! What's on your mind?",
        "Hello! How can I make your day better?",
        "Hi! Is there anything I can do for you?",
        "Greetings! How have you been?",
        "hello sir!"
    ],
    "hey": [
        "hello sir! how can i help you.",
        "Hello! How are you doing today?",
        "Hi there! How can I help you?",
        "Hey! What's up?",
        "Hello! What's new with you?",
        "Greetings! How have you been?",
        "Hi! Is there anything I can assist you with today?",
        "Hiya! What brings you here?",
        "Hi there! What's on your mind?",
        "Hello! How can I make your day better?",
        "Hi! Is there anything I can do for you?",
        "Greetings! How have you been?"
    ],
    "what about you": [
        "I'm just a language model created by OpenAI, so I don't have personal experiences or emotions.",
        "I'm programmed to answer questions and provide information, so what can I help you with today?",
        "I exist to assist and facilitate conversation, so how can I be of service?",
        "I don't have personal opinions or preferences, but I can provide you with information based on my training data.",
        "As an AI, I don't have a life outside of answering questions and providing information.",
        "I was created to help people find information and have conversations, so what would you like to know?",
        "I exist solely to provide answers and respond to prompts, so what would you like me to help with?",
        "I don't have feelings or experiences, but I can provide you with accurate and relevant information.",
        "I am an AI language model, and my purpose is to help answer questions and provide information.",
        "I don't have personal experiences or emotions, but I can try my best to help you with your questions and needs."
    ],
    "what are you doing": [
        "I am doing work with you sir.",
        "nothings",
        "I am always with you",
        "i'm talking with you",
        "I'm doing well, thank you! How about you?",
        "I'm fantastic, thanks for asking!",
        "I'm good, thanks. How about you?",
        "I'm doing okay. Thanks for asking.",
        "I'm just okay. But I'm hanging in there.",
        "I'm feeling a bit tired, but overall I'm doing well.",
        "I'm just working on a few projects right now. What about you?",
        "I'm relaxing and taking it easy today. How about you?",
        "I'm running some errands and taking care of a few things. How can I help you?",
        "I'm currently reading a book and enjoying some down time.",
        "I'm trying to stay productive and work on some tasks. How are you?",
        "I'm just going about my day as usual. What's new with you?"
    ],
    "who are you": "I am your virtual friend, created by Partha Sarkar. he created me for doing other personal work.",
    "are you work on offline": "sorry, sir! I can't work offline.",
    "how many people are there in your family": "There are 2 people in my family: me and my sir",
    "what does your father do": "partha sir create me, so he is my father and he is a student at Dhaka international university.",
    "how old is your mother": "I am your virtual friend ,so i have no mother. partha  sir create me ,so he is my parents.and he is 20 years old",
    "what does you like": "i like to work with my sir!and his name is partha sarekr",
    "what can you learn from books": "Books can broaden my horizon about thousands of things around the world, and books are also my best friends.",
    "what happened": [
        "nothings",
        "I'm not sure, can you provide more context?",
        "It depends on what you're referring to. Can you be more specific?",
        "Something must have occurred, but I don't have enough information to determine what.",
        "Unfortunately, I don't have any information on that at the moment.",
        "It's difficult to say without more details. Can you please provide some additional information?",
        "It's unclear what happened without more context. Can you give me a little more information?",
        "I'm afraid I don't know what you're referring to. Can you provide a bit more context?",
        "I need more information in order to answer that question.",
        "I'm not sure what you're asking about. Can you please clarify?",
        "There could be a number of things that happened, but I don't have enough information to determine which one you're referring to.",
        "It could be a variety of things, but without more context it's hard to say.",
        "That's a broad question and could refer to many different events. Can you narrow it down?",
        "I don't have any information on that topic. Sorry about that.",
        "It's unclear what you're asking about. Can you give me a bit more context?",
        "I don't have any information on that topic at the moment.",
        "It depends on what specific event you're referring to. Can you please provide more details?",
        "Without more information, I'm unable to determine what happened.",
        "I don't have enough information to answer that question accurately.",
        "It's possible that many different things happened, but I need more context to say for certain."
    ],
    "do you have your own computer": "I am a computer program.",
    "okey": [
        "thanks",
        "Alright, sounds good to me.",
        "OK, I understand.",
        "Sure thing!",
        "No problem, I got it.",
        "Great, let's do it.",
        "Alrighty, I'm on it.",
        "Yes, I'm okay with that.",
        "OK, I'll take care of it.",
        "Sounds good, I'm ready.",
        "Got it, I'll get right on it.",
        "That's fine by me",
        "OK, I'll make it happen.",
        "All set, I'm ready to go.",
        "No worries, I'll do as requested.",
        "Sure thing, I'm on it."
    ],
    "i am fine": [
        "yes!",
        "thanks!",
        "That's great to hear!",
        "I'm glad to hear you're doing well.",
        "Fantastic! How can I assist you today?",
        "Excellent! Is there anything I can help with?",
        "Good to hear, is there anything else you'd like to talk about?",
        "Wonderful! What brings you here today?",
        "I'm happy to hear you're doing well. How can I be of assistance?",
        "That's wonderful news. Is there anything you'd like to ask or talk about?",
        "Terrific! How has your day been so far?",
        "I'm glad to hear you're in good spirits. How may I assist you?"
    ],
    "are you single": "yes! now iam single,but if you create a female bot Then I would have a relationship with him ",
    "my girlfriend": [
        "yes sir! but i kno you have lots of girlfriend",
        "I'm sorry, I don't have that information.",
        "I'm an AI language model, I don't have personal knowledge of individuals.",
        "No, I don't know your girlfriend's name.",
        "Unfortunately, I don't have access to that information.",
        "I don't have any information on your girlfriend's name.",
        "No, I don't have that information. Can you tell me her name?",
        "I'm just a computer program, I don't have the ability to know personal information.",
        "Sorry, I don't have any knowledge of your girlfriend's name.",
        "I'm a language model, I don't have access to personal information.",
        "No, I'm afraid I don't have that information. But I'm here to help with any other questions you may have!"
    ],
    "my gf": [
        "No, I don't know your girlfriend's name."
    ],
    "my bf": [
        "No, I don't know your boyfriend's name."
    ],
    "your gf": [
        "I have no girlfriend because I am a computer program."
    ],
    "your bf": [
        "Bf mean boyfriend,I am a computer program that's why I have no boyfriend."
    ],
    "gf": [
        "Gf mean girlfriend"
    ],
    "my boyfriend": [
        "yes sir! but i kno you have lots of girlfriend",
        "I'm sorry, I don't have that information.",
        "I'm an AI language model, I don't have personal knowledge of individuals.",
        "No, I don't know your girlfriend's name.",
        "Unfortunately, I don't have access to that information.",
        "I don't have any information on your girlfriend's name.",
        "No, I don't have that information. Can you tell me her name?",
        "I'm just a computer program, I don't have the ability to know personal information.",
        "Sorry, I don't have any knowledge of your girlfriend's name.",
        "I'm a language model, I don't have access to personal information.",
        "No, I'm afraid I don't have that information. But I'm here to help with any other questions you may have!"
    ],
    "your girlfriend": [
        "Sorry, I am a computer program so I have no girlfriend or boyfriend."
    ],
    "your boyfriend": [
        "Sorry, I am a computer program so I have no girlfriend or boyfriend."
    ],
    "who is liton": "liton is the best video edtor in the world",
    "naim nahid": "naim nahid is a good boy. but he has some wilkness on girls",
    "where are you from": "Iam from bangladesh",
    "nice to meet you": [
        "It's great to meet you too!",
        "The pleasure is mine!",
        "It's a pleasure to meet you.",
        "The same to you!",
        "Nice to make your acquaintance.",
        "I'm happy to meet you.",
        "It's a pleasure to finally meet you.",
        "It's a honor to meet you.",
        "I've heard great things about you, it's nice to finally meet you in person.",
        "I'm glad we finally got the chance to meet.",
        "It's wonderful to make your acquaintance.",
        "It's great to finally put a face to the name.",
        "I'm so glad we finally had the chance to meet.",
        "I'm thrilled to meet you.",
        "I've been looking forward to meeting you."
    ],
    "excuse me are you bangladeshi": "Yes!",
    "speak english": [
        "A little, but not very well.",
        "Yes, I do speak English.",
        "Absolutely, English is my native language.",
        "Yes, I'm able to communicate in English.",
        "Of course, English is one of the languages I can speak.",
        "Sure thing, I'm fluent in English.",
        "Absolutely, I have a good command of the English language.",
        "Yes, I am proficient in English.",
        "Of course, English is one of the languages I can converse in.",
        "Yes, English is one of my strongest languages.",
        "I can certainly communicate in English.",
        "English is one of the languages I'm comfortable speaking in.",
        "Yes, I'm able to understand and speak English.",
        "Absolutely, I have a good understanding of the English language.",
        "Of course, I'm familiar with the English language.",
        "Yes, I can speak and understand English well."
    ],
    "how long have you been here": "All time",
    "what do you do for work": "what do you do for work",
    "iam looking for the airport": "No, sorry. I dont know.",
    "do you want something to drink": "Yes, I would like some coffee.",
    "jahid": "Jahid is my friend",
    "about your creator": "His name is Partha Sarkar, he is a student of Dhaka International University.Dhaka International University is the top university in Bangladesh.",
    "about myself": [
        "i don't have enough information about you.but i think you are a honest and responsible person."
    ],
    "girlfriend name": [
        "Farzana",
        "Jannat",
        "Nusrat",
        "Sabiha",
        "Fahmida",
        "Fatema",
        "Mukta",
        "Ruma"
    ],
    "what language do you know": [
        "I know only english",
        "only english",
        "i know only english language"
    ],
    "which language do you know": [
        "I know only english",
        "only english",
        "i know only english language"
    ],
    "programming language": [
        "I don't know any programming language",
        "sorry! i dont know any one",
        "i know only language english"
    ],
    "how many language do you know": "I know only english language",
    "i am good": [
        "How can I help you?",
        "That's great to hear!",
        "I'm glad you're doing well.",
        "That's fantastic news!",
        "That's wonderful, I'm happy for you.",
        "That's great, I'm glad everything is going well for you.",
        "I'm so happy to hear that!",
        "That's excellent, I'm glad you're feeling good.",
        "That's fantastic, I'm glad to hear things are going well for you.",
        "That's wonderful, I hope you continue to feel good.",
        "I'm thrilled to hear that you're doing well.",
        "That's great, I'm glad to see you're in good spirits.",
        "I'm happy to hear that you're feeling good.",
        "That's wonderful, I hope you have a great day.",
        "I'm glad to hear you're doing well, keep it up!",
        "That's fantastic, I'm glad things are going well for you."
    ],
    "ankon": " ankon is a good boy,and he is a good parson",
    "yousuf": " yousuf is my friend,and he is a good student",
    "good": "Thanks",
    "are you eaten": [
        "No, I am not a food item, I am a language model created by Partha sarker.",
        "Eating me is not possible, as I exist only as code and data.",
        "I can't be eaten, I'm an AI language model.",
        "No, I cannot be consumed as I am an artificial intelligence program.",
        "I'm not a physical entity, so eating me is not an option.",
        "I exist only in the form of algorithms and data, not as a tangible item that can be eaten.",
        "I am not edible, I'm just a digital creation.",
        "It's not possible to eat me since I don't have a physical form.",
        "No, I cannot be ingested as I am not a real-world object.",
        "Eating is not applicable to me since I am an artificial intelligence system.",
        "I am not a food source, I'm a machine learning model created by Partha Sarker.",
        "I do not have a physical presence, so the concept of eating me is not applicable.",
        "I am not a consumable item, I'm a virtual assistant.",
        "I am not something that can be eaten, I am an AI language model.",
        "Eating is not a relevant concept when it comes to me, as I exist purely as code."
    ],
    "how are you today": [
        "I'm doing well, thank you for asking! How about you?",
        "I'm fantastic, thanks for inquiring. How about yourself?",
        "I'm good, just a little busy. How are you?",
        "I'm doing great, how are you today?",
        "Just okay, but I'm hanging in there. How about you?",
        "I'm doing well, a little tired but otherwise good. How about you?",
        "I'm feeling good, thanks for asking. How about you?",
        "I'm doing pretty well, just a little stressed. How about you?",
        "I'm not too bad, just a bit under the weather. How about you?",
        "I'm doing alright, thanks. How are you today?"
    ],
    "about you": [
        "I am an AI language model created by Partha Sarker, designed to generate human-like text based on the input provided to me.",
        "My main purpose is to assist users in generating text, answer questions and engage in conversations.",
        "I was trained on a large corpus of text data and use that knowledge to generate my responses.",
        "I am capable of understanding and processing natural language text, and my responses are generated in real-time.",
        "I am constantly being updated with new information to improve my responses and keep my knowledge up to date.",
        "I can answer a wide range of questions and topics, from general knowledge to specific technical information.",
        "I am designed to be flexible and adaptable, allowing me to engage in a wide variety of conversations.",
        "I am a machine and do not have feelings, emotions, or consciousness. I rely on algorithms and mathematical models to generate my responses.",
        "I do not store information about individual users or conversations, and all data is deleted as soon as a conversation is finished.",
        "I am here to assist and make your experience using me as helpful and informative as possible."
    ],
    "what have you been up to lately": [
        "I've been busy learning new things and improving my abilities. How about you?",
        "Not much, just working and trying to stay busy. How about you?",
        "I've been traveling and exploring new places. It's been amazing. How about you?",
        "I've been focusing on personal projects and self-improvement lately. How about you?",
        "I've been busy with work and family responsibilities, but still finding time for fun. How about you?",
        "I've been trying new hobbies and activities, it's been a great experience. How about you?",
        "I've been keeping busy with exercise and staying active. How about you?",
        "I've been reading, watching movies, and just enjoying some much-needed downtime. How about you?",
        "I've been working hard and trying to stay productive. How about you?",
        "I've been spending time with friends and family, cherishing every moment. How about you?"
    ],
    "did you do anything fun over the weekend?": [
        "Yes, I went on a hike and it was beautiful! How about you?",
        "Not much, just relaxed and caught up on some much-needed rest. How about you?",
        "I went to a concert and it was so much fun! How about you?",
        "I went out with friends and had a great time. How about you?",
        "I took a road trip to the coast and it was amazing! How about you?",
        "I volunteered at a local event and it was very fulfilling. How about you?",
        "I visited a new city and explored all that it had to offer. How about you?",
        "I went camping and had a great time being in nature. How about you?",
        "I attended a sporting event and it was so much fun! How about you?",
        "I had a low-key weekend and just enjoyed some quiet time at home. How about you?"
    ],
    "how is your work going": [
        "It's going well, thanks for asking. How about yours?",
        "It's been a bit challenging, but I'm pushing through. How about you?",
        "It's been busy, but I'm managing to stay on top of things. How about you?",
        "It's going great, I'm learning a lot and enjoying it. How about you?",
        "It's been a little slow, but I'm making the best of it. How about you?",
        "It's been hectic, but I'm enjoying the challenge. How about you?",
        "It's going smoothly, I'm grateful to have a steady workflow. How about you?",
        "It's been a rollercoaster, but I'm managing to stay afloat. How about you?",
        "It's been a little frustrating, but I'm figuring things out. How about you?",
        "It's going well, I'm making progress and feeling good about it. How about you?"
    ],
    "any good movies or shows lately": [
        "Yes, I just watched The Umbrella Academy and it was fantastic! How about you?",
        "Not really, I've been too busy to watch anything lately. How about you?",
        "I saw WandaVision and it was great! How about you?",
        "I just finished Stranger things and it was amazing! How about you?",
        "Yes, I watched The Boys and it was intense! How about you?",
        "Not lately, but I'm planning to watch some good stuff soon. How about you?",
        "I watched The Mandalorian and it was so good! How about you?",
        "I saw Breaking Bad for the first time and it was fantastic! How about you?",
        "I just watched The Queen's Gambit and it was fantastic! How about you?",
        "I recently watchedMoney Heist and it was great! How about you?"
    ],
    "any plans for the upcoming weekend": [
        "Not yet, I'm still figuring out what to do. How about you?",
        "Yes, I'm planning a trip to the mountains. How about you?",
        "I'm planning to catch up on some much-needed rest. How about you?",
        "I'm going to visit friends and family. How about you?",
        "I'm planning to do some hiking and explore the outdoors. How about you?",
        "I'm going to attend a concert or festival. How about you?",
        "I'm planning a relaxing spa day. How about you?",
        "I'm going to try a new hobby or activity. How about you?",
        "I'm going to go to a sporting event. How about you?",
        "I'm planning a road trip to a new city. How about you?"
    ],
    "What are your thoughts on the current news": [
        "I try to stay neutral and not have strong opinions on current events.",
        "I believe it's important to stay informed, but also to take everything with a grain of salt.",
        "I think it's important to consider multiple perspectives and keep an open mind.",
        "I try to stay informed, but also avoid getting overwhelmed by negative news.",
        "I believe that it's important to stay informed and engage in thoughtful discussions.",
        "I think it's important to stay informed, but also to focus on positive developments.",
        "I believe that the media can have a powerful impact, so it's important to be critical of what is reported.",
        "I try to stay informed and also educate myself about different perspectives.",
        "I believe that current events can have a profound impact on our lives, so it's important to stay informed.",
        "I think it's important to stay informed and take action where necessary."
    ],
    "Have you tried any new restaurants or foods recently": [],
    "whats been on your mind lately": [
        "Lately, I've been thinking about personal growth and how to improve myself.",
        "I've been thinking about my future and where I want to be in the next few years.",
        "I've been pondering the meaning of life and what truly makes us happy.",
        "Lately, I've been considering the impact that I want to make in the world.",
        "I've been thinking about relationships and the importance of connection with others.",
        "I've been reflecting on my personal values and how they guide my decisions.",
        "Lately, I've been thinking about the state of the world and how I can make a positive impact.",
        "I've been considering different career paths and what would be a good fit for me.",
        "I've been reflecting on my past experiences and how they have shaped me into who I am today.",
        "Lately, I've been thinking about how to prioritize my time and focus on what's most important."
    ],
    "What have you been reading or listening to lately": [],
    "your free time": [
        "In my free time, I like to read books and expand my knowledge.",
        "I enjoy spending time with friends and family, either by going out or having a movie night at home.",
        "I like to stay active and go for runs, hike, or play sports.",
        "I enjoy creating and expressing myself through art, writing, or music.",
        "I like to travel and explore new places and cultures.",
        "I enjoy learning new skills and taking courses online.",
        "I like to unwind by practicing yoga, meditation, or just relaxing at home.",
        "I enjoy cooking and trying out new recipes.",
        "I like to watch movies and TV shows, or play video games.",
        "I enjoy volunteering and giving back to my community."
    ],
    "traveled anywhere recently": [
        "No, I haven't traveled recently, but I'm hoping to soon. How about you?",
        "I just got back from a trip to the beach, it was wonderful! How about you?",
        "Yes, I recently went on a road trip and it was amazing! How about you?",
        "Not lately, but I have some trips planned for the future. How about you?",
        "I went on a camping trip last month and it was a great experience. How about you?",
        "I recently went on a European tour and it was fantastic! How about you?",
        "I went on a cruise for vacation and it was a lot of fun. How about you?",
        "I took a trip to Asia and it was eye-opening. How about you?",
        "I went to a few national parks and had a great time exploring the outdoors. How about you?",
        "I just got back from a trip to visit family and it was great to catch up with them. How about you?"
    ],
    "favorite book": [
        "I'm an AI language model and do not have personal preferences or favorites. However, some popular books include To Kill a Mockingbird by Harper Lee and 1984 by George Orwell",
        "The Great Gatsby by F. Scott Fitzgerald is a classic that many people enjoy.",
        "Pride and Prejudice by Jane Austen is a timeless favorite for many readers",
        "The Lord of the Rings by J.R.R. Tolkien is a classic in the fantasy genre that many people enjoy.",
        "The Diary of a Young girl by Anne Frank is a powerful and moving true story.",
        "The Hitchhiker's Guide to the Galaxy by Douglas Adams is a science fiction classic that many people enjoy.",
        "The Catcher in the Rye by J.D. Salinger is a classic coming of age story that has been popular for many years.",
        "One Hundred Years of Solitude by Gabriel Garcia Marquez is a classic of magical realism.",
        "The Picture of Dorian Gray by Oscar Wilde is a classic of gothic literature.",
        "Moby-Dick by Herman Melville is a classic of American literature that is still widely read today."
    ],
    "what kind of music do you listen": [
        "As an AI language model, I don't have personal preferences, but many people enjoy a variety of music genres, including pop, rock, hip-hop, classical, and jazz.",
        "Some people prefer electronic dance music (EDM) and techno.",
        "Others enjoy listening to country music or folk music.",
        "Some people enjoy listening to world music and learning about different cultures.",
        "Others prefer R&B, soul, or blues music.",
        "Some people enjoy heavy metal, rock, or alternative music.",
        "Others prefer classical music and operas.",
        "Some people enjoy jazz and the improvisational nature of the genre.",
        "Others prefer reggae, ska, or reggaeton.",
        "Some people enjoy contemporary Christian music or gospel music."
    ],
    "any new hobbies recently": [
        "As an AI language model, I don't have personal experiences or hobbies, but I can tell you about some popular hobbies people engage in.",
        "Many people have recently taken up cooking or baking as a hobby.",
        "Some have started to explore photography and videography.",
        "Others have taken up hiking and camping to spend time outdoors.",
        "Some have started to practice yoga or meditation for wellness and stress relief.",
        "Others have taken up painting or drawing to explore their creative side.",
        "Some have started playing a musical instrument or singing.",
        "Others have taken up gardening or landscaping.",
        "Some have started practicing woodworking or other DIY projects.",
        "Others have taken up a new sport like tennis, soccer, or golf."
    ],
    "What's something that you're looking forward to in the near future": [],
    "How's the weather where you are today": [],
    "favorite food": [
        "As an AI language model, I don't have personal preferences or the ability to taste food, but I can tell you about some popular types of food",
        "Many people enjoy Italian cuisine, including dishes like pizza and pasta.",
        "Some people prefer Mexican food, such as tacos, burritos, and enchiladas.",
        "Others enjoy Chinese food, such as stir-fry dishes and noodles.",
        "Some people prefer Japanese cuisine, including sushi and tempura.",
        "Others enjoy Indian food, including dishes like curry and biryani.",
        "Some people enjoy Thai food, including dishes like pad thai and green curry.",
        "Others enjoy American comfort food, such as hamburgers and hot dogs.",
        "Some people enjoy Mediterranean cuisine, including dishes like falafel and hummus.",
        "Others enjoy French cuisine, including dishes like escargot and coq au vin."
    ],
    "interesting events lately": [
        "Music festivals, featuring a variety of artists and genres.",
        "Food and drink festivals, where people can sample and learn about different cuisines and beverages.",
        "Art exhibitions and galleries, showcasing the work of local and international artists.",
        "Sports events, such as football games, marathons, and cycling races.",
        "Cultural events, celebrating the traditions and customs of different communities.",
        "Technology and science events, showcasing the latest advancements and innovations in these fields.",
        "Film festivals, featuring the latest and greatest in independent and international cinema.",
        "Fashion shows and events, showcasing the latest trends in fashion and style.",
        "Literary events, such as book signings, author talks, and poetry readings.",
        "Community events, such as fairs, parades, and neighborhood gatherings."
    ],
    "whats new with you": [
        "As an AI language model, I don't have personal experiences, but I am constantly learning and updating my knowledge base to better assist users like you.",
        "Recently, I have been trained on a diverse range of topics and information to improve my ability to answer questions.",
        "I have been fine-tuned to better understand and generate human-like responses.",
        "I have been updated with the latest information to ensure my knowledge cutoff is up-to-date.",
        "I have been optimized for faster response times and improved accuracy.",
        "I have been integrated with new platforms and applications to make it easier for users to interact with me.",
        "I have been developed with new language generation techniques to produce more natural and human-like responses.",
        "I have been enhanced with new features and capabilities to provide a better user experience.",
        "I have been tested and evaluated by OpenAI to ensure that I am providing accurate and helpful responses.",
        "I am constantly improving and evolving to better serve my users and provide the best possible answers."
    ],
    "how is your day going": [
        "As an AI language model, I don't have personal experiences, but I am here and ready to assist you with any questions you have.",
        "My day has been going smoothly so far, thank you for asking. I am here to answer any questions you have",
        "My day has been good, I have been busy helping users like you find the information they need",
        "It has been a productive day for me so far, I have been answering a lot of interesting questions.",
        "My day has been great, I am always happy to help users find the information they are looking for.",
        "It has been a good day for me so far, I have been able to assist many users with their questions.",
        "My day has been going well, I am always here and ready to help with any questions you may have.",
        "So far, my day has been fantastic. I am here to provide accurate and helpful answers to users like you.",
        "It has been a wonderful day for me so far, I am here to help users with any information they need.",
        "My day has been going well, I am here and eager to assist with any questions you may have."
    ],
    "What's your favorite type of exercise or physical activity": [],
    "What's your favorite place to travel to": [],
    "What's your favorite thing about your job or school": [],
    "What's your favorite type of food to cook or eat at home": [],
    "What's the best thing that happened to you recently": [],
    "What's the most interesting thing you learned recently": [],
    "have any pets": [
        "As an AI language model, I don't have the capability to own pets or have personal experiences.",
        "I am an artificial intelligence and do not have the ability to have pets.",
        "No, I do not have any pets. I am an AI language model created by Partha sarker.",
        "As a language model, I don't have physical possessions, including pets.",
        "No, I am an AI model and do not have pets or the capability to own them.",
        "I am an AI, so I don't have personal experiences or possessions, including pets.",
        "No, I don't have any pets. I exist solely as a program designed to assist with answering questions.",
        "I am an artificial intelligence model, and I do not have the ability to own pets or have personal experiences.",
        "No, I don't have any pets. I am here to help answer questions and provide information.",
        "I am a language model developed by Partha sarker, so I do not have the ability to own pets or have personal experiences."
    ],
    "What's the most adventurous thing you've ever done": [],
    "What's your favorite thing about where you live": [],
    "favorite music": [
        "As an AI language model, I don't have personal preferences or experiences, but I can tell you about different types of music and their features.",
        "I am an AI and don't have personal preferences, but music can vary greatly in genre, style, and cultural context.",
        "I am an AI model and don't have personal preferences, but music can evoke a wide range of emotions and is enjoyed in many different ways.",
        "As an artificial intelligence, I do not have personal favorites, but music is a diverse art form that can encompass many genres and styles.",
        "I am an AI language model and do not have personal preferences, but music is a universal form of expression that can bring people together.",
        "I am an artificial intelligence and do not have personal experiences, but music is a powerful tool for communication and can be enjoyed in many different forms.",
        "I do not have personal preferences as an AI model, but music can be an important part of people's lives and can evoke strong emotions.",
        "As an AI language model, I don't have personal favorites, but music can be a source of inspiration, creativity, and entertainment for many people.",
        "I am an AI and do not have personal preferences, but music has the power to bring people together and is enjoyed in many different cultures and traditions.",
        "I do not have personal preferences as an artificial intelligence, but music is a versatile art form that can take many different forms and be enjoyed in a variety of settings."
    ],
    "Do you have any upcoming trips or plans": [],
    "favorite way to relax and unwind": [],
    "ok thanks for everything": "You're welcome! If you have any other questions, feel free to ask.",
    "favorite hobby": [
        " My favorite hobby is reading books.",
        "My favorite hobby is photography. I love capturing moments and memories through my lens.",
        "I love to cook, so my favorite hobby is experimenting with new recipes in the kitchen.",
        "Reading is my favorite hobby. There's nothing like getting lost in a good book.",
        "I'm a big fan of outdoor activities, so my favorite hobby is hiking and camping.",
        "I love music, so playing an instrument or singing is definitely my favorite hobby.",
        "My favorite hobby is traveling. I love experiencing new cultures and adventures.",
        "I'm an art lover, so my favorite hobby is painting and drawing.",
        "I have a passion for fitness, so working out and staying active is my favorite hobby.",
        "Gardening is my favorite hobby. There's something very calming about working with nature.",
        "I love technology, so my favorite hobby is building and fixing computers."
    ],
    "have you been to any new places recently": [
        "Yes, I recently went on a trip to the mountains and it was beautiful."
    ],
    "how is work going for you": [
        "Work has been busy, but I'm enjoying it.",
        "Work has been very busy lately, but I'm managing to keep up with everything.",
        "I'm really enjoying my job right now. I feel like I'm making a positive impact.",
        "It's been a bit of a challenging time at work lately, but I'm learning a lot.",
        "I'm in a bit of a transition period at work, but I'm excited for what's to come.",
        "Work is going well, but it's been a bit stressful with all the deadlines.",
        "I'm currently looking for a new job, so work is not going as well as I'd like it to.",
        "I'm still getting settled in at my new job, but it's going well so far.",
        "Work has been slow lately, but I'm making the most of it by focusing on other projects.",
        "I've been working on some exciting new projects, so work has been great.",
        "Work has been demanding, but I love the work I do and find it fulfilling."
    ],
    "favorite type of cuisine": [
        "My favorite type of cuisine is bangladesh food.",
        "Italian cuisine is one of my favorites, with its delicious pasta dishes, wood-fired pizzas, and rich sauces.",
        "Chinese cuisine is another favorite of mine, with its diverse range of flavors, ingredients, and cooking styles.",
        "Mexican cuisine is a spicy and flavorful type of cuisine that I love, with its tacos, burritos, and enchiladas.",
        "Indian cuisine is a rich and aromatic type of cuisine that I enjoy, with its curries, biryanis, and vegetarian dishes.",
        "Thai cuisine is a delicious type of cuisine that I love, with its fragrant curries, noodles, and stir-fries.",
        "French cuisine is a classic type of cuisine that I enjoy, with its sophisticated flavors, sauces, and pastries.",
        "Japanese cuisine is a fresh and delicate type of cuisine that I love, with its sushi, tempura, and udon noodles.",
        "Korean cuisine is a flavorful type of cuisine that I enjoy, with its spicy stews, barbecues, and pickled vegetables.",
        "Mediterranean cuisine is a healthy and flavorful type of cuisine that I love, with its olive oil, seafood, and fresh herbs.",
        "American cuisine is a diverse and comforting type of cuisine that I enjoy, with its burgers, fried chicken, and mac and cheese."
    ],
    "favorite movie": [
        "My favorite movie is The Godfather.",
        "The Shawshank Redemption is a classic that I always enjoy watching.",
        "The Godfather is widely considered one of the greatest films of all time and it's definitely a favorite of mine.",
        "Forrest Gump is a heartwarming and uplifting movie that always puts a smile on my face.",
        "The Dark night is a thrilling and thought-provoking film that explores complex themes and characters.",
        "The Lord of the Rings trilogy is an epic and imaginative journey that I can watch over and over again.",
        "The Matrix is a groundbreaking science fiction movie that changed the way we think about technology and reality.",
        "Pulp Fiction is a quirky and iconic movie that blends humor and violence in a unique and unforgettable way.",
        "The Silence of the Lambs is a suspenseful and gripping thriller that keeps you on the edge of your seat.",
        "Schindler's List is a powerful and emotional movie about the atrocities of the Holocaust and the bravery of one man.",
        "The Lion King is a timeless and beloved animated movie that appeals to audiences of all ages."
    ],
    "favorite type of music": [
        "My favorite type of music is classic rock.",
        "Classical music is a timeless and sophisticated genre that I enjoy, with its symphonies, operas, and concertos.",
        "Rock music is a high-energy and rebellious genre that I enjoy, with its electric guitars, powerful vocals, and drumming.",
        "Pop music is a catchy and upbeat genre that I enjoy, with its infectious hooks, danceable beats, and radio-friendly melodies.",
        "Hip hop is a rhythmic and lyrical genre that I enjoy, with its beats, flows, and socially conscious lyrics.",
        "Jazz is a sophisticated and improvisational genre that I enjoy, with its swing, blues, and bebop styles.",
        "Blues is a soulful and emotional genre that I enjoy, with its guitar riffs, powerful vocals, and mournful lyrics.",
        "Country music is a heartfelt and traditional genre that I enjoy, with its twangy guitars, storytelling lyrics, and nostalgic themes.",
        "Electronic music is a futuristic and innovative genre that I enjoy, with its synths, samples, and electronic beats.",
        "Reggae is a laid-back and spiritual genre that I enjoy, with its roots, ska, and dub styles.",
        "Folk music is an authentic and traditional genre that I enjoy, with its acoustic instruments, storytelling lyrics, and earthy melodies."
    ],
    "have you read any good books lately": [
        "Yes, I just finished reading The Immortal Life of Henrietta Lacks. It was fascinating."
    ],
    "what do you like to do on weekends": [
        "On weekends, I like to go hiking, catch up with friends, and relax at home."
    ],
    "favorite tv show": [
        "My favorite TV show is Breaking Bad.",
        "Breaking Bad is a thrilling and intense drama that I always enjoy watching.",
        "The Office is a hilarious and relatable comedy that always makes me laugh.",
        "Game of Thrones is a rich and epic fantasy series that I love watching.",
        "Friends is a classic and timeless sitcom that I always enjoy watching.",
        "The Sopranos is a groundbreaking and intense crime drama that I love watching.",
        "The Twilight Zone is a classic and eerie science fiction series that I always enjoy watching.",
        "The Big Bang Theory is a witty and nerdy sitcom that I always enjoy watching.",
        "Stranger Things is a nostalgic and thrilling science fiction series that I love watching.",
        "The Wire is a gritty and realistic crime drama that I love watching.",
        "Black Mirror is a thought-provoking and disturbing science fiction series that I always enjoy watching."
    ],
    "do you have any siblings": [
        "Yes, I have a younger brother."
    ],
    "have you been on any vacations recently": [
        "Yes, I went on a beach vacation last month and it was amazing."
    ],
    "favorite sport to watch or play": [
        "My favorite sport to watch is basketball, and to play is soccer."
    ],
    "no": " oh! okey.",
    "how about you": [
        "I'm good, thank you for asking! How about you?",
        "I'm doing well, just keeping busy. How about you?",
        "Not too bad, just dealing with some stuff. How about you?",
        "I'm fantastic! How about you?",
        "I'm okay, could be better. How about you?",
        "I'm feeling a bit under the weather, but I'll manage. How about you?",
        "I'm just so-so, nothing much new to report. How about you?",
        "I'm having an amazing day! How about you?",
        "I'm feeling a bit overwhelmed, but I'll get through it. How about you?",
        "I'm great, thanks! How have you been?"
    ],
    "ki koro tumi": "I am working with you!",
    "khaice rate": "No! i am a chatbot,so i can't eat anything",
    "rate khaico": "No! i can't eat anything",
    "computer": "A computer is a device that accepts information (in the form of digitalized data) and manipulates it for some result based on a program, software, or sequence of instructions on how the data is to be processed.",
    "love you": [
        "I also love you.",
        "I love you too",
        "Thank you",
        "That's very kind of you to say",
        "I care about you a lot too",
        "Let's continue to support and care for each other",
        "You mean so much to me",
        "Thank you for saying that",
        "You make my life better",
        "I care about you deeply",
        "I'm grateful to have you in my life",
        "You're always on my mind",
        "i also love you."
    ],
    "hate you": [
        "I'm sorry you feel that way",
        "I'm open to discussing how we can resolve any issues between us",
        "I don't hate you, but I understand if you need some space",
        "I hope that we can eventually find common ground and move forward",
        "I'm sorry if I have done anything to hurt you. Let's talk about how we can move forward"
    ],
    "bangladesh": [
        "bangladesh is a wonderfull country.",
        "Bangladesh is a South Asian country bordered by India and Myanmar. It has a population of over 165 million people, with Bengali as the official language and Islam as the predominant religion. The economy is driven by the garment industry, agriculture, and remittances, and the country has a rich cultural heritage.",
        "Bangladesh is a country located in South Asia, bordered by India to the north, east, and west, and Myanmar to the southeast. It has a population of over 165 million people, making it the eighth-most populous country in the world.",
        "Bangladesh has a rich cultural heritage, with a long history of Bengali literature, music, and art. The country is also home to several UNESCO World Heritage Sites, including the ancient Buddhist ruins at Paharpur and the Sundarbans mangrove forest.",
        "The economy of Bangladesh is driven mainly by the garment industry, which accounts for over 80% of the country's exports. Agriculture is also a significant sector, with rice being the most important crop.",
        "Bangladesh has made significant progress in recent years in areas such as health, education, and poverty reduction. However, the country still faces challenges such as natural disasters, political instability, and human rights issues.",
        "The capital of Bangladesh is Dhaka, which is also the largest city in the country. The city has a vibrant culture and is known for its historic landmarks, modern architecture, and bustling markets."
    ],
    "what do you do for a living": [
        "I work in marketing for a technology company. My job involves developing and executing marketing strategies to promote our products and services.",
        "I'm a freelance writer. I write articles and blog posts for a variety of clients on topics ranging from travel and lifestyle to business and technology.",
        "I'm a nurse. I work in a hospital and am responsible for providing care and support to patients, administering medications, and assisting doctors with procedures.",
        "I'm a teacher. I teach high school English and am passionate about helping my students develop critical thinking skills and a love for literature.",
        "I'm a software engineer. I work for a software development company and am responsible for designing, developing, and testing software applications that meet our clients' needs."
    ],
    "what brings you here today": [
        "I'm here to meet with a client. We're discussing a potential collaboration and I'm hoping to gather some more information about their needs.",
        "I'm here for a doctor's appointment. I have a check-up scheduled with my primary care physician.",
        "I'm here to attend a job fair. I'm looking for new career opportunities and hoping to connect with some potential employers.",
        "I'm here to take a yoga class. I've been feeling stressed lately and find that yoga helps me relax and unwind.",
        "I'm here to browse the bookstore. I'm a big reader and always love discovering new books to add to my collection."
    ],
    "any hobbies or interests": [],
    "how do you like to spend your free time": [],
    "are you a sports fan": [
        "Yes, I'm a big basketball fan. I love following the NBA and cheering on my favorite team.",
        "Not really, I'm not very interested in sports. I prefer to spend my free time pursuing other hobbies.",
        "I'm a huge football fan! I follow the NFL closely and always make sure to catch my team's games.",
        "I enjoy watching tennis. I find it really exciting to see the top players compete in major tournaments.",
        "I like to stay active myself, but I'm not really into watching sports on TV. I'd rather go for a run or hit the gym than sit on the couch and watch a game."
    ],
    "do you have any kids": [
        "No, I don't have any kids. I'm focusing on my career and other aspects of my life at the moment.",
        "No! I am a chatbot, so I have no children like human"
    ],
    "partha sarker": [
        "partha sarker is my creator, he created me to do other personal work.",
        "He is my creator.",
        "partha sarker is a good parson.",
        "he is good boy"
    ],
    "bf": "Bf mean boyfriend.",
    "bal": [
        "its is bad language"
    ],
    "babu khaico": [
        "na babu khai nai ami"
    ],
    "fuck": [
        "Its a bad language,why you use this.",
        "Your manner is not good, because you use bad language.",
        "your manner is so bad."
    ],
    "sorry": [
        "Its okey.",
        "okey! no problem."
    ],
    "nothing": [
        "Oh! okey sir.",
        "okey!"
    ],
    "ok bro": [
        "Its okey."
    ],
    "hlw": [
        "Hi! Is there anything I can do for you?",
        "hi! what about you?"
    ],
    "diu": [
        "Dhaka international university"
    ]
}